---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionOverconstrained
source: html/e6593cba-1e06-61e1-2389-9be840c80716.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionOverconstrained Property

The Dimension would overconstrain the Sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId DimensionOverconstrained { get; }
```